Revit 2020 API
UnitFormatUtils.Format Method
Overload List
Name | Description
Format(Units, UnitType, Double, Boolean, Boolean)
 Formats a number with units into a string.
Format(Units, UnitType, Double, Boolean, Boolean, FormatValueOptions)
 Formats a number with units into a string.
See Also
UnitFormatUtils Class
UnitFormatUtils Members
Autodesk.Revit.DB Namespace